#include <iostream>
#include <list>

//==============================================================================
// 1. Написать функцию, добавляющую в конец списка вещественных чисел элемент, 
// значение которого равно среднему арифметическому всех его элементов.
//==============================================================================

void PushAverageElement(std::list<double>& myList) {
    double sumEl = 0;
    for (auto el : myList) {
        sumEl += el;
    }
    myList.push_back(sumEl/myList.size());
}

void PrintList(std::list<double>& myList) {
    for (auto el : myList) {
        std::cout << el << " ";
    }
    std::cout << std::endl;
}

//==============================================================================
// 2. Создать класс, представляющий матрицу.
// Реализовать в нем метод, вычисляющий определитель матрицы.
// Для реализации используйте контейнеры из STL.
//==============================================================================
 





//==============================================================================
// 3. Реализовать собственный класс итератора, с помощью которого можно будет
// проитерироваться по диапазону целых чисел в цикле for - range - based.
//==============================================================================

class myClassIt {
private:
    int* first, * last;



public:

    int begin() {
        return *this->first;
    };
    int end() {
        return *this->last;
    }
    myClassIt& operator++() {
    
    }
};


int main()
{
    std::cout << "-----------Task 1-------------" << std::endl;
    std::list<double> myList = { 9.54, 10.66, 11.77, 5.2, 7.9 };
    //std::list<double> myList1 = { 10, 20 }; // для тестирования
    std::cout << "Before: ";
    PrintList(myList);
    
    PushAverageElement(myList);
    std::cout << "After: ";
    PrintList(myList);
    std::cout << "------------------------------" << std::endl;

    std::cout << "-----------Task 2-------------" << std::endl;
}